benchmarks/04-baseline-create.txt
Baseline: POST /shorten, creating a new link each time

Commit:   368523b
Date:     2026-09-04 13:59 IST
Machine:  Apple M5, 10 cores, macOS 26.6.2
Go:       go1.26.4
Postgres: 18.3 (Homebrew)
Rows:     2306273

Method:   3s warm-up, then 5 runs of 10s at 50 concurrent,
          30 seconds between runs. Load generator, server and database all
          on this one machine.
Command:  hey -z 10s -c 50 -disable-redirects -m POST -d {"url":"https://example.com/loadtest"} http://localhost:8080/shorten

Results per run:

  run   req/s        p99
  1     32800        0.0094
  2     34888        0.0064
  3     34366        0.0064
  4     34441        0.0065
  5     34253        0.0066

  median   34366        0.0065
  slowest  32800        0.0094
  fastest  34888        0.0064

The median is the number to quote. The spread between fastest and slowest is
how much of a difference this machine produces on its own, so a change smaller
than that spread has not been shown to do anything.

--------------------------- raw output, run 1 ---------------------------


Summary:
  Total:	10.0096 secs
  Slowest:	0.0771 secs
  Fastest:	0.0002 secs
  Average:	0.0015 secs
  Requests/sec:	32800.1412
  
  Total data:	20683845 bytes
  Size/request:	63 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [324025]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [4039]	|
  0.023 [167]	|
  0.031 [44]	|
  0.039 [22]	|
  0.046 [10]	|
  0.054 [2]	|
  0.062 [0]	|
  0.069 [2]	|
  0.077 [3]	|


Latency distribution:
  10%% in 0.0007 secs
  25%% in 0.0009 secs
  50%% in 0.0012 secs
  75%% in 0.0017 secs
  90%% in 0.0023 secs
  95%% in 0.0030 secs
  99%% in 0.0094 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0013 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0015 secs, 0.0002 secs, 0.0771 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	328315 responses



--------------------------- raw output, run 2 ---------------------------


Summary:
  Total:	10.0014 secs
  Slowest:	0.1077 secs
  Fastest:	0.0002 secs
  Average:	0.0014 secs
  Requests/sec:	34887.5470
  
  Total data:	21982338 bytes
  Size/request:	63 bytes

Response time histogram:
  0.000 [1]	|
  0.011 [348009]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.022 [654]	|
  0.032 [173]	|
  0.043 [45]	|
  0.054 [21]	|
  0.065 [9]	|
  0.075 [5]	|
  0.086 [2]	|
  0.097 [3]	|
  0.108 [4]	|


Latency distribution:
  10%% in 0.0007 secs
  25%% in 0.0009 secs
  50%% in 0.0011 secs
  75%% in 0.0016 secs
  90%% in 0.0022 secs
  95%% in 0.0028 secs
  99%% in 0.0064 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0036 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0014 secs, 0.0002 secs, 0.1077 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [201]	348926 responses



--------------------------- raw output, run 3 ---------------------------


Summary:
  Total:	10.0033 secs
  Slowest:	0.1072 secs
  Fastest:	0.0002 secs
  Average:	0.0015 secs
  Requests/sec:	34365.9133
  
  Total data:	21657762 bytes
  Size/request:	63 bytes

Response time histogram:
  0.000 [1]	|
  0.011 [342707]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.022 [724]	|
  0.032 [203]	|
  0.043 [79]	|
  0.054 [34]	|
  0.064 [7]	|
  0.075 [11]	|
  0.086 [4]	|
  0.096 [2]	|
  0.107 [2]	|


Latency distribution:
  10%% in 0.0007 secs
  25%% in 0.0009 secs
  50%% in 0.0012 secs
  75%% in 0.0016 secs
  90%% in 0.0023 secs
  95%% in 0.0029 secs
  99%% in 0.0064 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0038 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0014 secs, 0.0001 secs, 0.1072 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [201]	343774 responses



--------------------------- raw output, run 4 ---------------------------


Summary:
  Total:	10.0012 secs
  Slowest:	0.0808 secs
  Fastest:	0.0002 secs
  Average:	0.0015 secs
  Requests/sec:	34440.9998
  
  Total data:	21700350 bytes
  Size/request:	63 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [342827]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [1134]	|
  0.024 [290]	|
  0.032 [103]	|
  0.041 [54]	|
  0.049 [26]	|
  0.057 [5]	|
  0.065 [6]	|
  0.073 [2]	|
  0.081 [2]	|


Latency distribution:
  10%% in 0.0007 secs
  25%% in 0.0009 secs
  50%% in 0.0012 secs
  75%% in 0.0016 secs
  90%% in 0.0022 secs
  95%% in 0.0029 secs
  99%% in 0.0065 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0039 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0014 secs, 0.0002 secs, 0.0808 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	344450 responses



--------------------------- raw output, run 5 ---------------------------


Summary:
  Total:	10.0010 secs
  Slowest:	0.1008 secs
  Fastest:	0.0001 secs
  Average:	0.0015 secs
  Requests/sec:	34253.4837
  
  Total data:	21581910 bytes
  Size/request:	63 bytes

Response time histogram:
  0.000 [1]	|
  0.010 [341501]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.020 [774]	|
  0.030 [198]	|
  0.040 [66]	|
  0.050 [20]	|
  0.061 [2]	|
  0.071 [2]	|
  0.081 [0]	|
  0.091 [2]	|
  0.101 [4]	|


Latency distribution:
  10%% in 0.0007 secs
  25%% in 0.0009 secs
  50%% in 0.0012 secs
  75%% in 0.0016 secs
  90%% in 0.0023 secs
  95%% in 0.0029 secs
  99%% in 0.0066 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0033 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0014 secs, 0.0001 secs, 0.1007 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [201]	342570 responses